test-plans/23127107_Load_20260812.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="HW05 READ_HEAVY LOAD - Order Detail" enabled="true">
      <stringProp name="TestPlan.comments">Production Load plan for GET /api/orders/:id. Requires disposable backend runtime preflight and external hw05.auth_token property. No performance result is implied.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="baseUrl" elementType="Argument">
            <stringProp name="Argument.name">baseUrl</stringProp>
            <stringProp name="Argument.value">${__P(baseUrl,http://localhost:3000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="LOAD Phase A - Baseline 0 to 5 VUs" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV - READ_HEAVY Approved Orders - Baseline" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">test-data/read-heavy-orders.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">order_id,expected_user_id,expected_status,expected_total_amount,order_case,iteration_key</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header - External Bearer Token - Baseline" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Authorization" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${__P(hw05.auth_token,)}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Fail Closed - Require External Auth Token - Baseline" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
def token = props.get('hw05.auth_token')
if (token == null || token.toString().trim().isEmpty()) {
    throw new IllegalStateException('Missing required JMeter property hw05.auth_token. Run the mandatory disposable-runtime preflight and supply an external -q properties file.')
}
]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time - 500 to 1000 ms - Baseline" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
          <stringProp name="RandomTimer.range">500</stringProp>
        </UniformRandomTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Order Detail - Baseline" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">${baseUrl}/api/orders/${order_id}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200 - Baseline" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="expected-http-200">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200 for the approved READ_HEAVY success-path row.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Assert Order JSON Contract - Baseline" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

try {
    def body = new JsonSlurper().parseText(prev.getResponseDataAsString())
    if (!(body instanceof Map)) throw new IllegalStateException('Response must be a JSON object')
    def required = ['id', 'user_id', 'total_amount', 'status', 'shipping_address', 'created_at']
    def missing = required.findAll { !body.containsKey(it) }
    if (!missing.isEmpty()) throw new IllegalStateException('Missing required fields: ' + missing.join(','))
    if (body.id.toString() != vars.get('order_id')) throw new IllegalStateException('id does not match CSV order_id')
    if (body.user_id.toString() != vars.get('expected_user_id')) throw new IllegalStateException('user_id does not match CSV expectation')
    if (body.status.toString() != vars.get('expected_status')) throw new IllegalStateException('status does not match CSV expectation')
    if (body.total_amount.toString() != vars.get('expected_total_amount')) throw new IllegalStateException('total_amount does not match CSV expectation')
    if (!(body.created_at instanceof String) || body.created_at.trim().isEmpty()) throw new IllegalStateException('created_at must be a non-empty string')
    if (body.containsKey('error')) throw new IllegalStateException('Response must not contain error field')
} catch (Exception error) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('Order response assertion failed: ' + error.getMessage())
}
]]></stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="LOAD Phase B - Add 5 VUs at 40s" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">80</stringProp>
        <stringProp name="ThreadGroup.delay">40</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV - READ_HEAVY Approved Orders - Increment" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">test-data/read-heavy-orders.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">order_id,expected_user_id,expected_status,expected_total_amount,order_case,iteration_key</stringProp>
        </CSVDataSet>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header - External Bearer Token - Increment" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Authorization" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${__P(hw05.auth_token,)}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Fail Closed - Require External Auth Token - Increment" enabled="true">
          <stringProp name="cacheKey">true</stringProp>
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
def token = props.get('hw05.auth_token')
if (token == null || token.toString().trim().isEmpty()) {
    throw new IllegalStateException('Missing required JMeter property hw05.auth_token. Run the mandatory disposable-runtime preflight and supply an external -q properties file.')
}
]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>
        <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time - 500 to 1000 ms - Increment" enabled="true">
          <stringProp name="ConstantTimer.delay">500</stringProp>
          <stringProp name="RandomTimer.range">500</stringProp>
        </UniformRandomTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET Order Detail - Increment" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">${baseUrl}/api/orders/${order_id}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200 - Increment" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="expected-http-200">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected HTTP 200 for the approved READ_HEAVY success-path row.</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Assert Order JSON Contract - Increment" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script"><![CDATA[
import groovy.json.JsonSlurper

try {
    def body = new JsonSlurper().parseText(prev.getResponseDataAsString())
    if (!(body instanceof Map)) throw new IllegalStateException('Response must be a JSON object')
    def required = ['id', 'user_id', 'total_amount', 'status', 'shipping_address', 'created_at']
    def missing = required.findAll { !body.containsKey(it) }
    if (!missing.isEmpty()) throw new IllegalStateException('Missing required fields: ' + missing.join(','))
    if (body.id.toString() != vars.get('order_id')) throw new IllegalStateException('id does not match CSV order_id')
    if (body.user_id.toString() != vars.get('expected_user_id')) throw new IllegalStateException('user_id does not match CSV expectation')
    if (body.status.toString() != vars.get('expected_status')) throw new IllegalStateException('status does not match CSV expectation')
    if (body.total_amount.toString() != vars.get('expected_total_amount')) throw new IllegalStateException('total_amount does not match CSV expectation')
    if (!(body.created_at instanceof String) || body.created_at.trim().isEmpty()) throw new IllegalStateException('created_at must be a non-empty string')
    if (body.containsKey('error')) throw new IllegalStateException('Response must not contain error field')
} catch (Exception error) {
    AssertionResult.setFailure(true)
    AssertionResult.setFailureMessage('Order response assertion failed: ' + error.getMessage())
}
]]></stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>